Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: When an Objective-C initializer is imported by Swift, the init prefix becomes an init keyword to indicate that the method is a Swift initializer.
ja: Objective-Cイニシャライザがスウィフトによってインポートされる時、init接頭辞はinitキーワードになって、そのメソッドがスウィフトイニシャライザであることを指し示します。

source: When calling a function that takes a function pointer argument, you can pass a top-level Swift function, a closure literal, or nil.
ja: 関数ポインタ引数を取る関数を呼び出しているとき、あなたはトップレベルスウィフト関数、クロージャリテラル、またはnilを渡すことができます。

source: When declaring a computed property, provide a getter only to make it read-only and provide both a getter and setter to make it read/write.
ja: ある計算プロパティを宣言するとき、それを読み出し専用にするためにゲッターのみを提供してください、そしてそれを読み／書きにするためにゲッターとセッターの両方を提供してください。

source: When declaring a stored property, use let to make it read-only, and use var to make it read/write.
ja: ある保存プロパティを宣言するとき、それを読み出し専用にするためにletを、そしてそれを読み／書きにするためにvarを使ってください。

source: When importing C enumeration marked with the NS_OPTIONS macro, Swift marks any members that have a value of 0 as unavailable, because Swift uses an empty option set to specify no options.
ja: NS_OPTIONSマクロで印されたC列挙をインポートするとき、スウィフトは0の値を持つメンバはなんであれ利用不可として印します、なぜならスウィフトは空のオプションセットをオプション無しを指定するために使うからです。

source: When importing these types, Swift moves them to be nested types of their related types.
ja: それらの型をインポートするとき、スウィフトはそれらを移動して、それらの関連型の入れ子にされた型にします。

source: When overriding this method in a Swift subclass of NSDocument, the method replaces its error parameter and throws instead.
ja: このメソッドをNSDocumentのスウィフトのサブクラスにおいてオーバーライドする時、メソッドはそれのエラーパラメーターを置き替えて、代わりにスローをします。

source: When working with objects of type Any where the underlying type is known or could be reasonably determined, it is often useful to downcast those objects to a more specific type.
ja: 基礎をなす型が知られているかまずまず判定されることができるところの型Anyのオブジェクトを扱う時、そのようなオブジェクトをもっとはっきりした型へダウンキャストするのはしばしば便利です。

source: When working with opaque data types, you may need to perform unsafe pointer operations.
ja: 不透明データ型を扱うとき、あなたは非安全ポインタ演算を行う必要があるでしょう。

source: When writing Swift code that incorporates Cocoa frameworks, remember that certain types are bridged, which means you can work with Swift types in place of Objective-C types.
ja: ココア・フレームワークを取り入れるスウィフトコードを書くとき、特定の型が橋渡しをされるのを思い出してください、それはあなたがスウィフト型をObjective-C型の代わりに扱うことができるのを意味します。

source: When you are working with an Objective-C class or your Swift class inherits from an Objective-C class, Swift calls your class’s superclass dealloc method for you as well.
ja: あなたがObjective-CクラスまたはObjective-Cクラスから継承するあなたのスウィフトクラスを扱ってとき、スウィフトはあなたのクラスのスーパークラスのdeallocメソッドもまたあなたの代わりに呼び出します。

source: When you bridge from an NSArray object with a parameterized type to a Swift array, the element type of the resulting array is bridged as well.
ja: あなたがあるパラメーター化された型を使うNSArrayオブジェクトからスウィフト配列へとブリッジするとき、結果として生じる配列の要素型も同様にブリッジされます。

source: When you bridge from an NSDictionary object with parameterized types to a Swift dictionary, the resulting dictionary is of type [Key: Value].
ja: あなたがパラメーター化された型たちを使うあるNSDictionaryオブジェクトからスウィフト辞書へ橋渡しするとき、結果として得られる辞書は型[Key: Value]です。

source: When you bridge from an NSSet object with a parameterized type to a Swift set, the resulting set is of type Set<ObjectType>.
ja: あなたがあるパラメーター化された型を使うNSSetオブジェクトからスウィフト集合へ橋渡しするとき、結果として生じる集合は型Set<ObjectType>です。

source: When you bring Swift code into Objective-C, remember that Objective-C won’t be able to translate certain features that are specific to Swift.
ja: あなたがObjective-Cにスウィフトコードを連れて来るとき、Objective-Cがスウィフトに特有である特定の特徴を翻訳することができないのを思い出してください。

source: When you call a method on a value of AnyObject type, that method call behaves like an implicitly unwrapped optional.
ja: あなたがAnyObject型の値上でメソッドを呼ぶとき、そのメソッド呼び出しは暗黙的にアンラップされるオプショナルのように振る舞います。

source: When you create a Swift class that descends from an Objective-C class, the class and its members—properties, methods, subscripts, and initializers—that are compatible with Objective-C are automatically available from Objective-C.
ja: あなたがObjective-Cクラス由来のスウィフトクラスを作成するとき、そのクラスおよびObjective-C互換のそれのメンバー ― プロパティ、メソッド、添え字、そしてイニシャライザ ― は、自動的にObjective-Cから利用可能です。

source: When you create a custom view that inherits from the UIView class or the NSView class, you can add the @IBDesignable attribute just before the class declaration.
ja: あなたがUIViewクラスまたはNSViewクラスから継承するカスタムメイドのビューをつくるとき、あなたは@IBDesignable属性をクラス宣言の直前に加えることができます。

source: When you declare an outlet in Swift, you should make the type of the outlet an implicitly unwrapped optional.
ja: あなたがスウィフトにおいてアウトレットを宣言するとき、あなたはそのアウトレットの型を暗黙的にアンラップされるオプショナルにしなければなりません。

source: When you explicitly type a constant or variable as an NSArray object and assign it an array literal, Swift creates an NSArray object instead of a Swift array.
ja: あなたが明示的に定数または変数をNSArrayオブジェクトとして型指定して、それに配列リテラルを代入するとき、スウィフトはスウィフト配列でなくてNSArrayオブジェクトをつくります。

source: When you explicitly type a constant or variable as an NSDictionary object and assign it a dictionary literal, Swift creates an NSDictionary object instead of a Swift dictionary.
ja: あなたが明示的に定数または変数をNSDictionaryオブジェクトとして型指定して、それに辞書リテラルを代入するとき、スウィフトはスウィフト辞書でなくてNSDictionaryオブジェクトをつくります。

source: When you explicitly type a constant or variable as an NSSet object and assign it an array literal, Swift creates an NSSet object instead of a Swift set.
ja: あなたが明示的に定数または変数をNSSetオブジェクトとして型指定して、それに配列リテラルを代入するとき、スウィフトはスウィフト集合でなくてNSSetオブジェクトをつくります。

source: When you import Swift code into Objective-C, you rely on an Xcode-generated header file to expose those files to Objective-C.
ja: あなたがスウィフトコードをObjective-Cにインポートするとき、あなたはそれらのファイルをObjective-CにさらすためにXcode生成のヘッダファイルに頼ります。

source: When you import an external framework, make sure the Defines Module build setting for the framework you’re importing is set to “Yes”.
ja: あなたが外部のフレームワークをインポートするとき、あなたがインポートしているフレームワークのための「Defines Module」ビルド設定が「Yes」に設定されることを確認してください。

source: When you need to indicate that a value is missing, you use the value nil.
ja: あなたがある値が見つからないことを指し示す必要があるならば、あなたは値nilを使います。

source: When you receive an unmanaged object from an unannotated API, you should immediately convert it to a memory managed object before you work with it.
ja: あなたが注釈をつけられなかったAPIから管理されないオブジェクトを受け取るとき、あなたがそれを扱う前に、あなたは直ちにそれをメモリ管理されたオブジェクトに変換しなければなりません。

source: When you refer to an enumeration value, use the value name with a leading dot (.).
ja: あなたが列挙値に言及するとき、前にドット（.）をつけた値名を使用してください。

source: When you use the @objc(name) attribute on a Swift class, the class is made available in Objective-C without any namespacing.
ja: あなたがスウィフトクラス上で@objc(name)属性を使うとき、そのクラスは何ら名前空間操作なしにObjective-Cで利用できるようにされます。

source: When you want to perform additional clean-up before your class is deallocated, you can implement a deninitializer instead of the dealloc method.
ja: あなたのクラスがメモリ割り当て解除される前に、あなたが追加の掃除をしたいときは、あなたはdeallocメソッドでなくてデイニシャライザを実行することができます。

source: When your class is initialized from a storyboard or xib file, you can assume that the outlet has been connected.
ja: あなたのクラスがストーリーボードまたはxibファイルから初期化されるときは、あなたはアウトレットが接続されてしまっていることを確信できます。

source: When your code refers to a Swift class or protocol that comes from a different module, you import the Swift module into your Objective-C header using @import.
ja: あなたのコードが異なるモジュールから来るスウィフトクラスやプロトコルを参照する場合、あなたはスウィフトモジュールをあなたのObjective-Cヘッダへと@importを使ってインポートします。

source: Whenever an action is taken by the user, such as editing the text in a control or deleting an item at a selected row, an undo operation can be registered with the undo manager to allow the user to reverse the effect of that operation.
ja: あるアクションがユーザによってとられる時はいつでも、例えばテキストのカラーの編集や選択行での項目の削除などで、取り消し操作は取り消しマネージャを使って登録されることで、ユーザがその操作の効果を取り消せるようにされます。

source: Whenever possible, Swift avoids giving you direct access to pointers.
ja: 可能なときはいつでも、スウィフトはあなたにポインターへの直接のアクセスを与えることを避けます。

source: Where you typically used the #define directive to define a primitive constant in C and Objective-C, in Swift you use a global constant instead.
ja: あなたがCとObjective-Cでプリミティブ定数を定義するために概して#define指令を使ったところを、スウィフトでは、あなたはその代わりにグローバル定数を使います。

source: Wherever memory management annotations have been provided, Swift automatically manages the memory of Core Foundation objects, including Core Foundation objects that you instantiate yourself.
ja: メモリ管理注釈が提供されているどこででも、あなた自身でインスタンス化するコアファウンデーション・オブジェクトを含めて、スウィフトは自動的にコアファウンデーション・オブジェクトのメモリを管理します。

source: Wherever you would use CFTypeRef, you should now use AnyObject in your code.
ja: あなたがCFTypeRefを使うどこであろうとも、あなたは現在あなたのコードにおいてAnyObjectを使わなければなりません。

source: With this import statement, that Swift file can now access all of Foundation’s classes, protocols, methods, properties, and constants.
ja: このインポート文で、このスウィフトファイルは今や全てのFoundationのクラス、プロトコル、メソッド、プロパティ、そして定数にアクセスできます。

source: Without a check, the method call throws an NSInvalidArgumentException “unrecognized selector sent to instance” exception.
ja: 確認なしでは、メソッド呼び出しはNSInvalidArgumentException「認識不能セレクタがインスタンスに送られます」例外をスローします。

source: Working with Cocoa Frameworks
ja: Cocoaフレームワークを扱う

source: Working with Methods
ja: メソッドを扱う

source: Working with Outlets and Actions
ja: アウトレットとアクションを扱う

source: Writing Initializers and Deinitializers
ja: イニシャライザとデイニシャライザを書く

source: Writing Swift Classes and Protocols with Objective-C Behavior
ja: スウィフトのクラスとプロトコルをObjective-C挙動で書く

source: Xcode offers to create this header file when you add a Swift file to an existing Objective-C app, or an Objective-C file to an existing Swift app.
ja: Xcodeは、あなたがスウィフトファイルを既存のObjective-Cアプリに、またはObjective-Cファイルを既存のスウィフトアプリに加えるとき、このヘッダ・ファイルを作成することを提案します。

source: Xcode uses your product module name (PRODUCT_MODULE_NAME)—not your target name (TARGET_NAME)—when naming the Objective-C bridging header and the generated header for your Swift code.
ja: Xcodeは、あなたのスウィフトコードのためのObjective-C橋渡しヘッダと生成ヘッダに名前をつける時、あなたの製品モジュール名（PRODUCT_MODULE_NAME）を使います ― あなたのターゲット名（TARGET_NAME）でなく。

source: You access properties on Objective-C objects in Swift using dot syntax, using the name of the property without parentheses.
ja: あなたは、Objective-Cオブジェクト上のプロパティにスウィフトにおいてドット構文によって、そのプロパティの名前を丸括弧なして使ってアクセスします。

source: You adopt this approach by making your types conform to the Encodable or Decodable protocols, or by conforming to Codable as shorthand for conforming to both protocols.
ja: あなたはこの取り組み方を、あなたの型をEncodableまたはDecodableプロトコルに準拠するようにして、または両方のプロトコルへの準拠の簡略法としてCodableに準拠することによって採用します。

source: You can also add the @IBInspectable attribute to properties with types compatible with user defined runtime attributes.
ja: あなたは、また、ユーザー定義のランタイム属性と互換性を持つ型をもつプロパティへ@IBInspectable属性を加えることができます。

source: You can also bridge some toll-free bridged Core Foundation types to Swift standard library types if you cast to a bridging Foundation type first.
ja: あなたはまた、いくつかの無料の橋渡しされたコアファウンデーション型をスウィフト標準のライブラリ型に橋渡しをすることが、橋渡ししているファウンデーション型にあなたが最初にキャストするならば、可能です。

source: You can also call any Objective-C method and access any property on an AnyObject value without casting to a more specific class type.
ja: あなたはまた、あらゆるObjective-Cメソッドを呼び出すこと、そしてAnyObject値上のあらゆるプロパティにアクセスすることが、より具体的なクラス型にキャストすることなしに可能です。

source: You can also create an NSArray object directly from a Swift array literal, following the same bridging rules outlined above.
ja: あなたはまた、スウィフト配列リテラルから直接NSArrayオブジェクトをつくることが、上で概説されるのと同じ橋渡し規則にしたがって可能です。

source: You can also create an NSDictionary object directly from a Swift dictionary literal, following the same bridging rules outlined above.
ja: あなたはまた、NSDictionaryオブジェクトを直接にスウィフト辞書リテラルから作成することが、上で概説されるのと同じ橋渡し規則にしたがって可能です。

source: You can also create an NSNumber object using a floating-point, integer, or Boolean literal by explicitly providing a type annotation.
ja: あなたはまた、NSNumberオブジェクトを作成することが、浮動小数点、整数、またはブールのリテラルを使って明示的に型注釈を提供することによって可能です。

source: You can also create an NSSet object directly from a Swift array literal, following the same bridging rules outlined above.
ja: あなたはまた、NSSetオブジェクトを直接にスウィフト配列リテラルから作成することが、上で概説されるのと同じ橋渡し規則にしたがって可能です。

source: You can also create an NSString object using a string literal by explicitly providing a type annotation.
ja: あなたはまた、明示的に型注釈を提供することによって文字列リテラルを使ってNSStringオブジェクトを作成できます。

source: You can also invoke the retain(), release(), and autorelease() methods on unmanaged objects, but this approach is not recommended.
ja: あなたはまた、管理されないオブジェクトの上でretain()、release()、そしてautorelease()メソッドを呼び出すことができます、しかしこの取り組みは推薦されません。

source: You can also nest conditional compilation blocks within other conditional compilation blocks.
ja: あなたはまた、条件コンパイルブロックを他の条件コンパイルブロックの内部に入れ子にすることができます。

source: You can also pass a closure property of a generic type or a generic method as long as no generic type parameters are referenced in the closure’s argument list or body.
ja: あなたはまた、ひとつの総称体型のクロージャプロパティまたは総称体メソッドを渡すことが、いくつかの総称体型パラメータがクロージャの引数リストまたは本文において参照されるのでない限りは可能です。

source: You can also provide a custom name for the product module name and Xcode will use this when naming the bridging and generated headers.
ja: あなたはまた、あつらえの名前を製品モジュール名のために用意することができます、そしてXcodeはこれを橋渡しおよび生成ヘッダに名前をつけるとき使います。

source: You can also specify a log level defined by the logging system, such as Info, Debug, or Error, in order to control how log messages are handled according to the importance of the logging event.
ja: あなたはまた、ログイベントの重要性にそってどのようにログメッセージが取り扱われるか制御するために、ログシステムによって定義されるログ水準、例えばInfo、Debug、またはErrorを指定することが可能です。

source: You can also try and downcast to the subclass type by using the as? operator.
ja: あなたはまた、as?演算子を使うことによって、そのサブクラス型へのダウンキャストを試みることができます。

source: You can also use an if–let statement to conditionally unwrap the result of a method that the object may not respond to, as shown on line three.
ja: あなたはまたif–let文を使用して、３行目で示されるように、条件付きでオブジェクトが応答しないかもしれないメソッドの結果をアンラップすることができます。

source: You can also use extensions to add protocol conformance to a class without subclassing it.
ja: あなたはまた拡張を使って、プロトコル準拠をあるクラスに、それをサブクラス化することなく加えることができます。

source: You can also use the CF_IMPLICIT_BRIDGING_ENABLED and CF_IMPLICIT_BRIDGING_DISABLED macros to enclose C function declarations that follow Core Foundation ownership policy naming policy in order to infer memory management from naming.
ja: あなたはまた、CF_IMPLICIT_BRIDGING_ENABLEDとCF_IMPLICIT_BRIDGING_DISABLEDマクロを使って、C関数宣言たち、それらは名前の付け方からメモリ管理を推測するためのコアファウンデーション所有者方針の命名方針に従うもの、を取り囲むことができます。

source: You can annotate an Objective-C typedef declaration with the NS_TYPED_ENUM or NS_TYPED_EXTENSIBLE_ENUM macro to have constants of that type imported by Swift as members of a common type.
ja: あなたは、Objective-Cのtypedef宣言にNS_TYPED_ENUMまたはNS_TYPED_EXTENSIBLE_ENUMマクロで注釈をつけることで、その型の定数をスウィフトによって普通の型のメンバとしてインポートされるようにします。

source: You can call Objective-C methods from Swift using dot syntax.
ja: あなたは、Objective-Cメソッドをスウィフトからドット構文を使って呼び出すことができます。

source: You can call it in any of the following ways:
ja: あなたは、以下の方法の何ででもそれを呼ぶことができます：

source: You can call it in the following way:
ja: あなたは、以下の方法でそれを呼ぶことができます：

source: You can check whether an instance is of a certain subclass type by using the is operator.
ja: あなたは、あるインスタンスが特定のサブクラス型であるかどうか、is演算子を使うことによって調べることができます。

source: You can combine compilation conditions using the && and || operators, negate them with the ! operator, and add branches with #elseif and #else compilation directives.
ja: あなたは、コンパイル条件を&&と||を使って結合すること、!演算子でそれらを無効にすること、そして#elseifと#else条件指示子で分岐を加えることができます。

source: You can create a GroceryProduct from a JSON representation by creating a JSONDecoder instance and passing it the GroceryProduct.self type along with the JSON data:
ja: あなたはGroceryProductをJSON表現から作成することがJSONDecoderインスタンスを作成してそれをGroceryProduct.self型にそのJSONデータとともに渡すことによって可能です。

source: You can create a new option set value using an array literal, and access option values with a leading dot (.), similar to an enumeration.
ja: あなたは、新しいオプションセット値を配列リテラルを使って作成すること、そしてオプション値へ前に付けたドット（.）で、列挙のようにアクセスすることができます。

source: You can create an NSNumber object by casting a Swift number value using the as operator.
ja: あなたは、NSNumberオブジェクトを作成することが、スウィフト数値をas演算子を使ってキャストすることによって可能です。

source: You can create an NSString object by casting a String value using the as operator.
ja: あなたは、NSStringオブジェクトの作成が、String値をas演算子を使ってキャストすることで可能です。

source: You can create your own singletons as a way to provide a unified access point to a resource or service that’s shared across an app, such as an audio channel to play sound effects or a network manager to make HTTP requests.
ja: あなたは、あるアプリ全体で共有されるリソースやサービス、例えばサウンドエフェクトを再生するオーディオチャンネルやHTTPリクエストを行うネットワークマネージャなどへの一本化されたアクセスポイントを提供する方法として、あなた自身のシングルトンを作成します。

source: You can define an extension on a type from either a system framework or one of your own custom types.
ja: あなたは、システム・フレームワークから、またはあなた独自のあつらえの型の１つから、そのどちらかの型の上で拡張を定義することができます。

source: You can denote the availability of your own APIs by annotating declarations with the @available attribute.
ja: あなたは、宣言に@available属性で注釈を付けることによって、あなたの独自APIの有効性を示すことができます。

source: You can do the same in Swift as follows:
ja: あなたは、同じことをスウィフトにおいて以下のように行えます：

source: You can format a log message using an NSString or printf format string along with one or more trailing arguments.
ja: あなたはログメッセージをフォーマットすることが、NSStringまたはprintfフォーマット文字列を１つ以上の後に続く引数とともに使うことで行えます。

source: You can get a list of any command-line arguments that are specified at launch by accessing the CommandLine.arguments type property.
ja: あなたは、起動時にCommandLine.arguments型プロパティにアクセスすることによって指定される、あらゆるコマンドライン引数のリストを得ることができます。

source: You can import a framework into any Objective-C .m file within a different target using the following syntax:
ja: あなたは、フレームワークを異なるターゲット内のどんなObjective-C .mファイルにでも以下の構文を使ってインポートすることができます：

source: You can import a framework into any Swift file within a different target using the following syntax:
ja: あなたはフレームワークをある異なるターゲット内のどんなスウィフトファイルにでも、以下の構文を使ってインポートすることができます：

source: You can import external frameworks that have a pure Objective-C codebase, a pure Swift codebase, or a mixed-language codebase.
ja: あなたは、純粋なObjective-Cコードベース、純粋なスウィフトコードベース、または混合言語のコードベースを持つ外部のフレームワークをインポートすることができます。

source: You can indicate whether initializers in your own Objective-C classes can fail using nullability annotations, as described in Nullability and Optionals.
ja: あなたは、あなた独自のObjective-Cクラスの中のイニシャライザが失敗できるかどうかをヌル許可注釈を使って指し示すことができます、それはヌル許可とオプショナルで記述されます。

source: You can invoke an Objective-C method on an Objective-C compatible object using a selector with the perform(_:) method or one of its variants.
ja: あなたはObjective-CメソッドをObjective-C互換オブジェクト上で発動することがperform(_:)メソッドやそれの変種の１つを持つセレクタを使うことで可能です。

source: You can override isEqual: in a subclass to have Swift and Objective-C APIs determine equality based on the contents of objects rather than their identities.
ja: あなたは、isEqual:をサブクラスにおいてオーバーライドして、それらの同一性ではなくてオブジエクトの内容に基づいて同等性を判断するスウィフトとObjective-C APIを持つことができます。

source: You can provide a refined Swift interface in an extension like this:
ja: あなたは、改良スウィフトインターフェイスをある拡張においてこのように提供することができます：

source: You can provide an explicit type when assigning to a constant or variable, or you can omit the type and have Swift infer the type automatically from the initializer.
ja: あなたは、定数または変数に割り当てする時に明示的な型を提供することができます、またはあなたは型を省略してスウィフトに型をイニシャライザから自動的に推論させることができます。

source: You can set up your Swift class to integrate Objective-C behavior by subclassing Objective-C classes, adopting Objective-C protocols, and more.
ja: あなたは、あなたのスウィフトクラスをObjective-Cクラスのサブクラスにすること、Objective-Cプロトコルを採用すること、そしてもっと多くのことによって、Objective-C挙動に溶け込むように準備することができます。

source: You can simply add a file of the other language directly to an existing project.
ja: あなたは、単に既存のプロジェクトに直接他の言語のファイルを加えることができます。

source: You can still use Swift methods and properties that are marked with the internal modifier from within the Objective-C part of your framework, as long they are declared within a class that inherits from an Objective-C class.
ja: あなたは依然としてinternal修飾子で印されるスウィフトのメソッドとプロパティをあなたのフレームワークのObjecctive-C部分の内部から使うことができます、それらがObjective-Cクラスから継承するクラスの内部で宣言される限りは。

source: You can subclass Objective-C classes, declare and adopt Objective-C protocols, and take advantage of other Objective-C functionality when writing Swift code.
ja: あなたは、スウィフトコードを記述する時に、Objective-Cクラスのサブクラス作成、Objective-Cプロトコルの宣言と採用、そして他のObjective-C機能性の利用が可能です。

source: You can take advantage of Cocoa’s undo architecture in Swift just as you would in Objective-C.
ja: あなたは、Cocoaの取り消し機構の長所をスウィフトにおいてまさにあなたがObjective-Cでするように利用できます。

source: You can use Objective-C APIs in Swift, and you can use Swift APIs in Objective-C.
ja: あなたはObjective-CのAPIをスウィフトにおいて使うことができます、そしてあなたはスウィフト APIをObjective-Cにおいて使うことができます。

source: You can use extensions to add properties (including class and static properties).
ja: あなたは、拡張を使ってプロパティ（クラスや静的なプロパティを含む）を加えることができます。

source: You can use it to resolve circularity for bridging methods and to allow overloading of methods for classes imported by Objective-C.
ja: あなたはそれを使って、メソッドをブリッジすることの循環性を解決して、Objective-Cでインポートされるクラスに対してメソッドのオーバーロードを可能にします。

source: You can use key-value observing with a Swift class, as long as the class inherits from the NSObject class.
ja: あなたは、そのクラスがNSObjectクラスから継承する限り、スウィフトクラスでキー値監視を使うことができます。

source: You can use optional binding to unwrap the result of a failable initializer if initialization is successful.
ja: あなたはオプショナル束縛を使って、初期化がうまくいったならば失敗できるイニシャライザの結果をアンラップすることができます。

source: You can use the @objc(name) attribute to change the name of a class, property, method, enumeration type, or enumeration case declaration in your interface as it’s exposed to Objective-C code.
ja: あなたは、@objc(name)属性を使うことで、あなたのインターフェイスにおいてクラス、プロパティ、メソッド、列挙型、または列挙ケース宣言の名前を変更することがそれがObjective-Cコードに露出されるときに可能です。

source: You can use the @objc(name) attribute to explicitly specify the corresponding Objective-C symbol.
ja: あなたは、>@objc(name)属性を使うことで、対応するObjective-Cシンボルを明示的に指定することができます。

source: You can use the CF_SWIFT_NAME macro in your own code to have Swift import C functions as members of the imported structure type.
ja: あなたは、CF_SWIFT_NAMEマクロをあなた自身のコードにおいて使うことで、スウィフトがC関数をインポートされた構造体型のメンバとしてインポートするようにします。

source: You can use the NS_REFINED_FOR_SWIFT macro on an Objective-C method declaration to provide a refined Swift interface in an extension, while keeping the original implementation available to be called from the refined interface.
ja: あなたは、NS_REFINED_FOR_SWIFTマクロをObjective-Cメソッド宣言上で使って、ある拡張において改良スウィフトインターフェイスを提供して、オリジナル実装を利用可能に保ったまま、その改良インターフェイスから呼び出されるようにできます。

source: You can use the Foundation framework classes JSONEncoder and PropertyListEncoder to convert instances to JSON or property list data.
ja: あなたは、FoundationフレームワーククラスJSONEncoderとPropertyListEncoderを使って、インスタンスをJSONまたはプロパティリストデータへ変換します。

source: You can use the arithmetic operators on Swift pointer values to create new pointers at a specified offset.
ja: あなたは算術演算子をスウィフトポインタ値上で使って、新しいポインタを指定されたオフセットで作成することができます。

source: You can use the conditional type cast operator (as?), which returns an optional value of the type you are trying to downcast to:
ja: あなたは、条件型キャスト演算子（as?）を使うことができます、それは、あなたがそれへとダウンキャストを試みている型のオプショナルの値を返します：

source: You can use the same optional chaining syntax you would use for optional methods in protocols to optionally invoke a method on AnyObject.
ja: あなたは、プロトコルにおいてオプショナルメソッドに対して使う同じオプショナル連鎖構文を使って、AnyObject上でメソッドを随意なものとして発動することができます。

source: You can use the same or a different name than your Objective-C class.
ja: あなたは、あなたのObjective-Cクラスと同じまたは異なる名前を使用することができます。

source: You can use them in the same way you would in Objective-C, accessing any properties and calling any methods defined on their respective types.
ja: あなたは、それらをあなたがObjective-Cでするのと同じ方法で使って、それらの各自の型上で定義される、どんなプロパティにでもアクセスして、どんなメソッドでも呼び出すことができます。

source: You can use these two steps to implement key-value observing in Swift.
ja: あなたは、これら２つの手順を使ってキー値監視をスウィフトにおいて実装できます。

source: You can use this feature, called mix and match, to write apps that have a mixed-language codebase.
ja: あなたはこの特徴、混合と適合と呼ばれるものを働かせて、混合言語のコードベースを持つアプリを記述することができます。
